文档重构、增加私人微信登录能力扩展
